# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'java'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'python'
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'pnpm'

# Apps
cask 'bitwarden'
cask 'boop'
cask 'caffeine'
cask 'discord'
cask 'dbngin'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'google-chrome'
cask 'herd'
cask 'imageoptim'
cask 'iterm2'
cask 'logi-options-plus'
cask 'notion'
cask 'obsidian'
cask 'phpstorm'
cask 'qbittorrent'
cask 'ray'
cask 'raycast'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Games
cask 'battle-net'
cask 'multimc'
cask 'steam'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Goodnotes 6', id: 1444383602